Ro5bert/avra/includes/m4809def.inc
; ***** BIT AND VALUE DEFINITIONS ****************************************


;*************************************************************************
;** AC - Analog Comparator
;*************************************************************************

; AC_CTRLA masks
.equ AC_ENABLE_bm = 0x01                 ; Enable bit mask
.equ AC_ENABLE_bp = 0                    ; Enable bit position
.equ AC_HYSMODE_gm = 0x06                ; Hysteresis Mode group mask
.equ AC_HYSMODE_gp = 1                   ; Hysteresis Mode group position
.equ AC_HYSMODE0_bm = (1<<1)             ; Hysteresis Mode bit 0 mask
.equ AC_HYSMODE0_bp = 1                  ; Hysteresis Mode bit 0 position
.equ AC_HYSMODE1_bm = (1<<2)             ; Hysteresis Mode bit 1 mask
.equ AC_HYSMODE1_bp = 2                  ; Hysteresis Mode bit 1 position
.equ AC_INTMODE_gm = 0x30                ; Interrupt Mode group mask
.equ AC_INTMODE_gp = 4                   ; Interrupt Mode group position
.equ AC_INTMODE0_bm = (1<<4)             ; Interrupt Mode bit 0 mask
.equ AC_INTMODE0_bp = 4                  ; Interrupt Mode bit 0 position
.equ AC_INTMODE1_bm = (1<<5)             ; Interrupt Mode bit 1 mask
.equ AC_INTMODE1_bp = 5                  ; Interrupt Mode bit 1 position
.equ AC_LPMODE_bm = 0x08                 ; Low Power Mode bit mask
.equ AC_LPMODE_bp = 3                    ; Low Power Mode bit position
.equ AC_OUTEN_bm = 0x40                  ; Output Buffer Enable bit mask
.equ AC_OUTEN_bp = 6                     ; Output Buffer Enable bit position
.equ AC_RUNSTDBY_bm = 0x80               ; Run in Standby Mode bit mask
.equ AC_RUNSTDBY_bp = 7                  ; Run in Standby Mode bit position

; AC_DACREF masks
.equ AC_DATA_gm = 0xFF                   ; DAC voltage reference group mask
.equ AC_DATA_gp = 0                      ; DAC voltage reference group position
.equ AC_DATA0_bm = (1<<0)                ; DAC voltage reference bit 0 mask
.equ AC_DATA0_bp = 0                     ; DAC voltage reference bit 0 position
.equ AC_DATA1_bm = (1<<1)                ; DAC voltage reference bit 1 mask
.equ AC_DATA1_bp = 1                     ; DAC voltage reference bit 1 position
.equ AC_DATA2_bm = (1<<2)                ; DAC voltage reference bit 2 mask
.equ AC_DATA2_bp = 2                     ; DAC voltage reference bit 2 position
.equ AC_DATA3_bm = (1<<3)                ; DAC voltage reference bit 3 mask
.equ AC_DATA3_bp = 3                     ; DAC voltage reference bit 3 position
.equ AC_DATA4_bm = (1<<4)                ; DAC voltage reference bit 4 mask
.equ AC_DATA4_bp = 4                     ; DAC voltage reference bit 4 position
.equ AC_DATA5_bm = (1<<5)                ; DAC voltage reference bit 5 mask
.equ AC_DATA5_bp = 5                     ; DAC voltage reference bit 5 position
.equ AC_DATA6_bm = (1<<6)                ; DAC voltage reference bit 6 mask
.equ AC_DATA6_bp = 6                     ; DAC voltage reference bit 6 position
.equ AC_DATA7_bm = (1<<7)                ; DAC voltage reference bit 7 mask
.equ AC_DATA7_bp = 7                     ; DAC voltage reference bit 7 position

; AC_INTCTRL masks
.equ AC_CMP_bm = 0x01                    ; Analog Comparator 0 Interrupt Enable bit mask
.equ AC_CMP_bp = 0                       ; Analog Comparator 0 Interrupt Enable bit position

; AC_MUXCTRLA masks
.equ AC_INVERT_bm = 0x80                 ; Invert AC Output bit mask
.equ AC_INVERT_bp = 7                    ; Invert AC Output bit position
.equ AC_MUXNEG_gm = 0x03                 ; Negative Input MUX Selection group mask
.equ AC_MUXNEG_gp = 0                    ; Negative Input MUX Selection group position
.equ AC_MUXNEG0_bm = (1<<0)              ; Negative Input MUX Selection bit 0 mask
.equ AC_MUXNEG0_bp = 0                   ; Negative Input MUX Selection bit 0 position
.equ AC_MUXNEG1_bm = (1<<1)              ; Negative Input MUX Selection bit 1 mask
.equ AC_MUXNEG1_bp = 1                   ; Negative Input MUX Selection bit 1 position
.equ AC_MUXPOS_gm = 0x18                 ; Positive Input MUX Selection group mask
.equ AC_MUXPOS_gp = 3                    ; Positive Input MUX Selection group position
.equ AC_MUXPOS0_bm = (1<<3)              ; Positive Input MUX Selection bit 0 mask
.equ AC_MUXPOS0_bp = 3                   ; Positive Input MUX Selection bit 0 position
.equ AC_MUXPOS1_bm = (1<<4)              ; Positive Input MUX Selection bit 1 mask
.equ AC_MUXPOS1_bp = 4                   ; Positive Input MUX Selection bit 1 position

; AC_STATUS masks
; Masks for AC_CMP already defined
.equ AC_STATE_bm = 0x10                  ; Analog Comparator State bit mask
.equ AC_STATE_bp = 4                     ; Analog Comparator State bit position

; Hysteresis Mode select
.equ AC_HYSMODE_OFF_gc = (0x00<<1)       ; No hysteresis
.equ AC_HYSMODE_10mV_gc = (0x01<<1)      ; 10mV hysteresis
.equ AC_HYSMODE_25mV_gc = (0x02<<1)      ; 25mV hysteresis
.equ AC_HYSMODE_50mV_gc = (0x03<<1)      ; 50mV hysteresis

; Interrupt Mode select
.equ AC_INTMODE_BOTHEDGE_gc = (0x00<<4)  ; Any Edge
.equ AC_INTMODE_NEGEDGE_gc = (0x02<<4)   ; Negative Edge
.equ AC_INTMODE_POSEDGE_gc = (0x03<<4)   ; Positive Edge

; Low Power Mode select
.equ AC_LPMODE_DIS_gc = (0x00<<3)        ; Low power mode disabled
.equ AC_LPMODE_EN_gc = (0x01<<3)         ; Low power mode enabled

; Negative Input MUX Selection select
.equ AC_MUXNEG_PIN0_gc = (0x00<<0)       ; Negative Pin 0
.equ AC_MUXNEG_PIN1_gc = (0x01<<0)       ; Negative Pin 1
.equ AC_MUXNEG_PIN2_gc = (0x02<<0)       ; Negative Pin 2
.equ AC_MUXNEG_DACREF_gc = (0x03<<0)     ; DAC Voltage Reference

; Positive Input MUX Selection select
.equ AC_MUXPOS_PIN0_gc = (0x00<<3)       ; Positive Pin 0
.equ AC_MUXPOS_PIN1_gc = (0x01<<3)       ; Positive Pin 1
.equ AC_MUXPOS_PIN2_gc = (0x02<<3)       ; Positive Pin 2
.equ AC_MUXPOS_PIN3_gc = (0x03<<3)       ; Positive Pin 3


;*************************************************************************
;** ADC - Analog to Digital Converter
;*************************************************************************

