Ro5bert/avra/includes/m4809def.inc
; CCL_LUT1CTRLA masks
; Masks for CCL_CLKSRC already defined
; Masks for CCL_EDGEDET already defined
; Masks for CCL_ENABLE already defined
; Masks for CCL_FILTSEL already defined
; Masks for CCL_OUTEN already defined

; CCL_LUT1CTRLB masks
; Masks for CCL_INSEL0 already defined
; Masks for CCL_INSEL1 already defined

; CCL_LUT1CTRLC masks
; Masks for CCL_INSEL2 already defined

; CCL_LUT2CTRLA masks
; Masks for CCL_CLKSRC already defined
; Masks for CCL_EDGEDET already defined
; Masks for CCL_ENABLE already defined
; Masks for CCL_FILTSEL already defined
; Masks for CCL_OUTEN already defined

; CCL_LUT2CTRLB masks
; Masks for CCL_INSEL0 already defined
; Masks for CCL_INSEL1 already defined

; CCL_LUT2CTRLC masks
; Masks for CCL_INSEL2 already defined

; CCL_LUT3CTRLA masks
; Masks for CCL_CLKSRC already defined
; Masks for CCL_EDGEDET already defined
; Masks for CCL_ENABLE already defined
; Masks for CCL_FILTSEL already defined
; Masks for CCL_OUTEN already defined

; CCL_LUT3CTRLB masks
; Masks for CCL_INSEL0 already defined
; Masks for CCL_INSEL1 already defined

; CCL_LUT3CTRLC masks
; Masks for CCL_INSEL2 already defined

; CCL_SEQCTRL0 masks
.equ CCL_SEQSEL0_gm = 0x07               ; Sequential Selection group mask
.equ CCL_SEQSEL0_gp = 0                  ; Sequential Selection group position
.equ CCL_SEQSEL00_bm = (1<<0)            ; Sequential Selection bit 0 mask
.equ CCL_SEQSEL00_bp = 0                 ; Sequential Selection bit 0 position
.equ CCL_SEQSEL01_bm = (1<<1)            ; Sequential Selection bit 1 mask
.equ CCL_SEQSEL01_bp = 1                 ; Sequential Selection bit 1 position
.equ CCL_SEQSEL02_bm = (1<<2)            ; Sequential Selection bit 2 mask
.equ CCL_SEQSEL02_bp = 2                 ; Sequential Selection bit 2 position

; CCL_SEQCTRL1 masks
.equ CCL_SEQSEL1_gm = 0x07               ; Sequential Selection group mask
.equ CCL_SEQSEL1_gp = 0                  ; Sequential Selection group position
.equ CCL_SEQSEL10_bm = (1<<0)            ; Sequential Selection bit 0 mask
.equ CCL_SEQSEL10_bp = 0                 ; Sequential Selection bit 0 position
.equ CCL_SEQSEL11_bm = (1<<1)            ; Sequential Selection bit 1 mask
.equ CCL_SEQSEL11_bp = 1                 ; Sequential Selection bit 1 position
.equ CCL_SEQSEL12_bm = (1<<2)            ; Sequential Selection bit 2 mask
.equ CCL_SEQSEL12_bp = 2                 ; Sequential Selection bit 2 position

; CCL_TRUTH0 masks
.equ CCL_TRUTH_gm = 0xFF                 ; Truth Table group mask
.equ CCL_TRUTH_gp = 0                    ; Truth Table group position
.equ CCL_TRUTH0_bm = (1<<0)              ; Truth Table bit 0 mask
.equ CCL_TRUTH0_bp = 0                   ; Truth Table bit 0 position
.equ CCL_TRUTH1_bm = (1<<1)              ; Truth Table bit 1 mask
.equ CCL_TRUTH1_bp = 1                   ; Truth Table bit 1 position
.equ CCL_TRUTH2_bm = (1<<2)              ; Truth Table bit 2 mask
.equ CCL_TRUTH2_bp = 2                   ; Truth Table bit 2 position
.equ CCL_TRUTH3_bm = (1<<3)              ; Truth Table bit 3 mask
.equ CCL_TRUTH3_bp = 3                   ; Truth Table bit 3 position
.equ CCL_TRUTH4_bm = (1<<4)              ; Truth Table bit 4 mask
.equ CCL_TRUTH4_bp = 4                   ; Truth Table bit 4 position
.equ CCL_TRUTH5_bm = (1<<5)              ; Truth Table bit 5 mask
.equ CCL_TRUTH5_bp = 5                   ; Truth Table bit 5 position
.equ CCL_TRUTH6_bm = (1<<6)              ; Truth Table bit 6 mask
.equ CCL_TRUTH6_bp = 6                   ; Truth Table bit 6 position
.equ CCL_TRUTH7_bm = (1<<7)              ; Truth Table bit 7 mask
.equ CCL_TRUTH7_bp = 7                   ; Truth Table bit 7 position

; CCL_TRUTH1 masks
; Masks for CCL_TRUTH already defined

; CCL_TRUTH2 masks
; Masks for CCL_TRUTH already defined

; CCL_TRUTH3 masks
; Masks for CCL_TRUTH already defined

; Interrupt Mode for LUT0 select
.equ CCL_INTMODE0_INTDISABLE_gc = (0x00<<0) ; Interrupt disabled
.equ CCL_INTMODE0_RISING_gc = (0x01<<0)  ; Sense rising edge
.equ CCL_INTMODE0_FALLING_gc = (0x02<<0) ; Sense falling edge
.equ CCL_INTMODE0_BOTH_gc = (0x03<<0)    ; Sense both edges

; Interrupt Mode for LUT1 select
.equ CCL_INTMODE1_INTDISABLE_gc = (0x00<<2) ; Interrupt disabled
.equ CCL_INTMODE1_RISING_gc = (0x01<<2)  ; Sense rising edge
.equ CCL_INTMODE1_FALLING_gc = (0x02<<2) ; Sense falling edge
.equ CCL_INTMODE1_BOTH_gc = (0x03<<2)    ; Sense both edges

; Interrupt Mode for LUT2 select
.equ CCL_INTMODE2_INTDISABLE_gc = (0x00<<4) ; Interrupt disabled
.equ CCL_INTMODE2_RISING_gc = (0x01<<4)  ; Sense rising edge
.equ CCL_INTMODE2_FALLING_gc = (0x02<<4) ; Sense falling edge
.equ CCL_INTMODE2_BOTH_gc = (0x03<<4)    ; Sense both edges

; Interrupt Mode for LUT3 select
.equ CCL_INTMODE3_INTDISABLE_gc = (0x00<<6) ; Interrupt disabled
.equ CCL_INTMODE3_RISING_gc = (0x01<<6)  ; Sense rising edge
.equ CCL_INTMODE3_FALLING_gc = (0x02<<6) ; Sense falling edge
.equ CCL_INTMODE3_BOTH_gc = (0x03<<6)    ; Sense both edges

; Clock Source Selection select
.equ CCL_CLKSRC_CLKPER_gc = (0x00<<1)    ; CLK_PER is clocking the LUT
.equ CCL_CLKSRC_IN2_gc = (0x01<<1)       ; IN[2] is clocking the LUT
.equ CCL_CLKSRC_OSC20M_gc = (0x04<<1)    ; 20MHz oscillator before prescaler is clocking the LUT
.equ CCL_CLKSRC_OSCULP32K_gc = (0x05<<1) ; 32kHz oscillator is clocking the LUT
.equ CCL_CLKSRC_OSCULP1K_gc = (0x06<<1)  ; 32kHz oscillator after DIV32 is clocking the LUT

; Edge Detection Enable select
.equ CCL_EDGEDET_DIS_gc = (0x00<<7)      ; Edge detector is disabled
.equ CCL_EDGEDET_EN_gc = (0x01<<7)       ; Edge detector is enabled

; Filter Selection select
.equ CCL_FILTSEL_DISABLE_gc = (0x00<<4)  ; Filter disabled
.equ CCL_FILTSEL_SYNCH_gc = (0x01<<4)    ; Synchronizer enabled
.equ CCL_FILTSEL_FILTER_gc = (0x02<<4)   ; Filter enabled

; LUT Input 0 Source Selection select
.equ CCL_INSEL0_MASK_gc = (0x00<<0)      ; Masked input
.equ CCL_INSEL0_FEEDBACK_gc = (0x01<<0)  ; Feedback input source
.equ CCL_INSEL0_LINK_gc = (0x02<<0)      ; Linked LUT input source
.equ CCL_INSEL0_EVENTA_gc = (0x03<<0)    ; Event input source A
.equ CCL_INSEL0_EVENTB_gc = (0x04<<0)    ; Event input source B
.equ CCL_INSEL0_IO_gc = (0x05<<0)        ; IO pin LUTn-IN0 input source
.equ CCL_INSEL0_AC0_gc = (0x06<<0)       ; AC0 OUT input source
.equ CCL_INSEL0_USART0_gc = (0x08<<0)    ; USART0 TXD input source
.equ CCL_INSEL0_SPI0_gc = (0x09<<0)      ; SPI0 MOSI input source
.equ CCL_INSEL0_TCA0_gc = (0x0A<<0)      ; TCA0 WO0 input source
.equ CCL_INSEL0_TCB0_gc = (0x0C<<0)      ; TCB0 WO input source

