Ro5bert/avra/includes/m4809def.inc
; Event Output C select
.equ PORTMUX_EVOUTC_DEFAULT_gc = (0x00<<2) ; EVOUT on PC2
.equ PORTMUX_EVOUTC_ALT1_gc = (0x01<<2)  ; EVOUT on PC7

; Event Output D select
.equ PORTMUX_EVOUTD_DEFAULT_gc = (0x00<<3) ; EVOUT on PD2
.equ PORTMUX_EVOUTD_ALT1_gc = (0x01<<3)  ; EVOUT on PD7

; Event Output E select
.equ PORTMUX_EVOUTE_DEFAULT_gc = (0x00<<4) ; EVOUT on PE2

; Event Output F select
.equ PORTMUX_EVOUTF_DEFAULT_gc = (0x00<<5) ; EVOUT on PF2

; Port Multiplexer TCA0 select
.equ PORTMUX_TCA0_PORTA_gc = (0x00<<0)   ; TCA0 pins on PA[5:0]
.equ PORTMUX_TCA0_PORTB_gc = (0x01<<0)   ; TCA0 pins on PB[5:0]
.equ PORTMUX_TCA0_PORTC_gc = (0x02<<0)   ; TCA0 pins on PC[5:0]
.equ PORTMUX_TCA0_PORTD_gc = (0x03<<0)   ; TCA0 pins on PD[5:0]
.equ PORTMUX_TCA0_PORTE_gc = (0x04<<0)   ; TCA0 pins on PE[5:0]
.equ PORTMUX_TCA0_PORTF_gc = (0x05<<0)   ; TCA0 pins on PF[5:0]

; Port Multiplexer TCB0 select
.equ PORTMUX_TCB0_DEFAULT_gc = (0x00<<0) ; WO on PA2
.equ PORTMUX_TCB0_ALT1_gc = (0x01<<0)    ; WO on PF4

; Port Multiplexer TCB1 select
.equ PORTMUX_TCB1_DEFAULT_gc = (0x00<<1) ; WO on PA3
.equ PORTMUX_TCB1_ALT1_gc = (0x01<<1)    ; WO on PF5

; Port Multiplexer TCB2 select
.equ PORTMUX_TCB2_DEFAULT_gc = (0x00<<2) ; WO on PC0
.equ PORTMUX_TCB2_ALT1_gc = (0x01<<2)    ; WO on PB4

; Port Multiplexer TCB3 select
.equ PORTMUX_TCB3_DEFAULT_gc = (0x00<<3) ; WO on PB5
.equ PORTMUX_TCB3_ALT1_gc = (0x01<<3)    ; WO on PC1

; Port Multiplexer SPI0 select
.equ PORTMUX_SPI0_DEFAULT_gc = (0x00<<0) ; SPI0 on PA[7:4]
.equ PORTMUX_SPI0_ALT1_gc = (0x01<<0)    ; SPI0 on PC[3:0]
.equ PORTMUX_SPI0_ALT2_gc = (0x02<<0)    ; SPI0 on PE[3:0]
.equ PORTMUX_SPI0_NONE_gc = (0x03<<0)    ; Not connected to any pins

; Port Multiplexer TWI0 select
.equ PORTMUX_TWI0_DEFAULT_gc = (0x00<<4) ; SCL/SDA on PA[3:2], Slave mode on PC[3:2] in dual TWI mode
.equ PORTMUX_TWI0_ALT1_gc = (0x01<<4)    ; SCL/SDA on PA[3:2], Slave mode on PF[3:2] in dual TWI mode
.equ PORTMUX_TWI0_ALT2_gc = (0x02<<4)    ; SCL/SDA on PC[3:2], Slave mode on PF[3:2] in dual TWI mode
.equ PORTMUX_TWI0_NONE_gc = (0x03<<4)    ; Not connected to any pins

; Port Multiplexer USART0 select
.equ PORTMUX_USART0_DEFAULT_gc = (0x00<<0) ; USART0 on PA[3:0]
.equ PORTMUX_USART0_ALT1_gc = (0x01<<0)  ; USART0 on PA[7:4]
.equ PORTMUX_USART0_NONE_gc = (0x03<<0)  ; Not connected to any pins

; Port Multiplexer USART1 select
.equ PORTMUX_USART1_DEFAULT_gc = (0x00<<2) ; USART1 on PC[3:0]
.equ PORTMUX_USART1_ALT1_gc = (0x01<<2)  ; USART1 on PC[7:4]
.equ PORTMUX_USART1_NONE_gc = (0x03<<2)  ; Not connected to any pins

; Port Multiplexer USART2 select
.equ PORTMUX_USART2_DEFAULT_gc = (0x00<<4) ; USART2 on PF[3:0]
.equ PORTMUX_USART2_ALT1_gc = (0x01<<4)  ; USART2 on PF[6:4]
.equ PORTMUX_USART2_NONE_gc = (0x03<<4)  ; Not connected to any pins

; Port Multiplexer USART3 select
.equ PORTMUX_USART3_DEFAULT_gc = (0x00<<6) ; USART3 on PB[3:0]
.equ PORTMUX_USART3_ALT1_gc = (0x01<<6)  ; USART3 on PB[5:4]
.equ PORTMUX_USART3_NONE_gc = (0x03<<6)  ; Not connected to any pins


;*************************************************************************
;** RSTCTRL - Reset controller
;*************************************************************************

; RSTCTRL_RSTFR masks
.equ RSTCTRL_BORF_bm = 0x02              ; Brown out detector Reset flag bit mask
.equ RSTCTRL_BORF_bp = 1                 ; Brown out detector Reset flag bit position
.equ RSTCTRL_EXTRF_bm = 0x04             ; External Reset flag bit mask
.equ RSTCTRL_EXTRF_bp = 2                ; External Reset flag bit position
.equ RSTCTRL_PORF_bm = 0x01              ; Power on Reset flag bit mask
.equ RSTCTRL_PORF_bp = 0                 ; Power on Reset flag bit position
.equ RSTCTRL_SWRF_bm = 0x10              ; Software Reset flag bit mask
.equ RSTCTRL_SWRF_bp = 4                 ; Software Reset flag bit position
.equ RSTCTRL_UPDIRF_bm = 0x20            ; UPDI Reset flag bit mask
.equ RSTCTRL_UPDIRF_bp = 5               ; UPDI Reset flag bit position
.equ RSTCTRL_WDRF_bm = 0x08              ; Watch dog Reset flag bit mask
.equ RSTCTRL_WDRF_bp = 3                 ; Watch dog Reset flag bit position

; RSTCTRL_SWRR masks
.equ RSTCTRL_SWRE_bm = 0x01              ; Software reset enable bit mask
.equ RSTCTRL_SWRE_bp = 0                 ; Software reset enable bit position


;*************************************************************************
;** RTC - Real-Time Counter
;*************************************************************************

; RTC_CALIB masks
.equ RTC_ERROR_gm = 0x7F                 ; Error Correction Value group mask
.equ RTC_ERROR_gp = 0                    ; Error Correction Value group position
.equ RTC_ERROR0_bm = (1<<0)              ; Error Correction Value bit 0 mask
.equ RTC_ERROR0_bp = 0                   ; Error Correction Value bit 0 position
.equ RTC_ERROR1_bm = (1<<1)              ; Error Correction Value bit 1 mask
.equ RTC_ERROR1_bp = 1                   ; Error Correction Value bit 1 position
.equ RTC_ERROR2_bm = (1<<2)              ; Error Correction Value bit 2 mask
.equ RTC_ERROR2_bp = 2                   ; Error Correction Value bit 2 position
.equ RTC_ERROR3_bm = (1<<3)              ; Error Correction Value bit 3 mask
.equ RTC_ERROR3_bp = 3                   ; Error Correction Value bit 3 position
.equ RTC_ERROR4_bm = (1<<4)              ; Error Correction Value bit 4 mask
.equ RTC_ERROR4_bp = 4                   ; Error Correction Value bit 4 position
.equ RTC_ERROR5_bm = (1<<5)              ; Error Correction Value bit 5 mask
.equ RTC_ERROR5_bp = 5                   ; Error Correction Value bit 5 position
.equ RTC_ERROR6_bm = (1<<6)              ; Error Correction Value bit 6 mask
.equ RTC_ERROR6_bp = 6                   ; Error Correction Value bit 6 position
.equ RTC_SIGN_bm = 0x80                  ; Error Correction Sign Bit bit mask
.equ RTC_SIGN_bp = 7                     ; Error Correction Sign Bit bit position

; RTC_CLKSEL masks
.equ RTC_CLKSEL_gm = 0x03                ; Clock Select group mask
.equ RTC_CLKSEL_gp = 0                   ; Clock Select group position
.equ RTC_CLKSEL0_bm = (1<<0)             ; Clock Select bit 0 mask
.equ RTC_CLKSEL0_bp = 0                  ; Clock Select bit 0 position
.equ RTC_CLKSEL1_bm = (1<<1)             ; Clock Select bit 1 mask
.equ RTC_CLKSEL1_bp = 1                  ; Clock Select bit 1 position

